tutorials/multiphaseTransport/interTransportFoam/2DthroatMultiphaseTransport/0_org/Mflux
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      Mflux;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -3 -1 0 0 0 0];

internalField   uniform 0; 

boundaryField
{
    walls
    {
        type            calculated;
        value           uniform 0; 
    }
    inlet
    {
        type            calculated;
        value           uniform 0; 
    }
    outlet
    {
        type            calculated;
        value           uniform 0;
    }
    frontandback
    {
        type            empty;
    }
}


// ************************************************************************* //
